* List of solutions

| Day | Title                 |        Part 1 |           Part2 | Done afterwards |
|-----+-----------------------+---------------+-----------------+-----------------|
|   1 | Historian Hysteria    |       2113135 |        19097157 |                 |
|   2 | Red-Nosed Reports     |           299 |             364 |                 |
|   3 | Mull It Over          |     156388521 |        75920122 |                 |
|   4 | Ceres Search          |          2462 |            1877 |                 |
|   5 | Print Queue           |          5955 |            4030 |                 |
|   6 | Guard Gallivant       |          4711 |            1562 |                 |
|   7 | Bridge Repair         | 1038838357795 | 254136560217241 |                 |
|   8 | Resonant Collinearity |           285 |             944 |                 |
|   9 | Disk Fragmenter       | 6382875730645 |   6420913943576 |                 |
|  10 | Hoof It               |           629 |            1242 |                 |
|  11 | Plutonian Pebbles     |        239714 | 284973560658514 |                 |
|  12 | Garden Groups         |       1533024 |          910066 |                 |
|  13 | Claw Contraption      |         31761 |  90798500745591 |                 |
|  14 | Restroom Redoubt      |     224357412 |            7083 |                 |
|  15 | Warehouse Woes        |       1318523 |         1337648 |                 |
|  16 |                       |               |                 |                 |
|  17 |                       |               |                 |                 |
|  18 |                       |               |                 |                 |
|  19 |                       |               |                 |                 |
|  20 |                       |               |                 |                 |
|  21 |                       |               |                 |                 |
|  22 |                       |               |                 |                 |
|  23 |                       |               |                 |                 |
|  24 |                       |               |                 |                 |
|  25 |                       |               |                 |                 |


* Stars

| Period                    | number |
|---------------------------+--------|
| Achieved during the month |     30 |
| Achieved later            |        |
| Total                     |     30 |
|                           |        |
#+TBLFM: @4$2=vsum(@2..@3)
